app/controllers/api/v1/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
---
  def index
    @inventories = Inventory.all