app/controllers/api/v1/orders_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" IN (1, 2, 3)
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (1, 2)
SELECT "orders".* FROM "orders"
---
  def index
    @orders = Order.includes(:order_items, :inventories).all